results/fio-test5-10pods-3gb-7030-252kb/fio-benchmark-6.log
Starting FIO benchmark on pod 6...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=20G
runtime=600
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

[test5-3gb-7030-256k]
rw=randrw
rwmixread=70
bs=256k
# Strict Rate Limiter (Total 3GB/s = ~375m per thread, 70/30 split)
rate=262m,113m
---
test5-3gb-7030-256k: (g=0): rw=randrw, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
test5-3gb-7030-256k: Laying out IO file (1 file / 20480MiB)
test5-3gb-7030-256k: Laying out IO file (1 file / 20480MiB)
test5-3gb-7030-256k: Laying out IO file (1 file / 20480MiB)
[...]

test5-3gb-7030-256k: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 10:49:24 2026
  read: IOPS=6376, BW=1594MiB/s (1672MB/s)(934GiB/600017msec)
    slat (usec): min=9, max=747, avg=19.45, stdev= 7.85
    clat (usec): min=259, max=717878, avg=13976.44, stdev=12845.60
     lat (usec): min=276, max=717899, avg=13995.89, stdev=12845.64
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   12], 40.00th=[   12], 50.00th=[   13], 60.00th=[   14],
     | 70.00th=[   16], 80.00th=[   17], 90.00th=[   19], 95.00th=[   22],
     | 99.00th=[   28], 99.50th=[   32], 99.90th=[  262], 99.95th=[  300],
     | 99.99th=[  535]
   bw (  MiB/s): min=  835, max= 2658, per=100.00%, avg=1594.51, stdev=21.22, samples=9592
   iops        : min= 3340, max=10634, avg=6378.03, stdev=84.88, samples=9592
  write: IOPS=2734, BW=684MiB/s (717MB/s)(401GiB/600017msec); 0 zone resets
    slat (usec): min=14, max=1048, avg=35.50, stdev=13.22
    clat (usec): min=698, max=707940, avg=14042.12, stdev=12895.60
     lat (usec): min=723, max=707968, avg=14077.62, stdev=12895.66
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   12], 40.00th=[   13], 50.00th=[   14], 60.00th=[   14],
     | 70.00th=[   16], 80.00th=[   17], 90.00th=[   19], 95.00th=[   21],
     | 99.00th=[   27], 99.50th=[   32], 99.90th=[  264], 99.95th=[  300],
     | 99.99th=[  535]
   bw (  KiB/s): min=350208, max=1219584, per=100.00%, avg=700236.31, stdev=10653.47, samples=9592
   iops        : min= 1368, max= 4764, avg=2735.30, stdev=41.61, samples=9592
  lat (usec)   : 500=0.01%, 750=0.03%, 1000=0.04%
  lat (msec)   : 2=0.11%, 4=0.12%, 10=15.93%, 20=77.25%, 50=6.33%
  lat (msec)   : 100=0.05%, 250=0.02%, 500=0.10%, 750=0.02%
  cpu          : usr=0.87%, sys=2.53%, ctx=5243955, majf=0, minf=474
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3826097,1640877,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1594MiB/s (1672MB/s), 1594MiB/s-1594MiB/s (1672MB/s-1672MB/s), io=934GiB (1003GB), run=600017-600017msec
  WRITE: bw=684MiB/s (717MB/s), 684MiB/s-684MiB/s (717MB/s-717MB/s), io=401GiB (430GB), run=600017-600017msec
FIO benchmark completed on pod 6